// 128. 最长连续序列
// 中等
// 相关标签
// premium lock icon
// 相关企业
// 给定一个未排序的整数数组 nums ，找出数字连续的最长序列（不要求序列元素在原数组中连续）的长度。

// 请你设计并实现时间复杂度为 O(n) 的算法解决此问题。

// 示例 1：

// 输入：nums = [100,4,200,1,3,2]
// 输出：4
// 解释：最长数字连续序列是 [1, 2, 3, 4]。它的长度为 4。
// 示例 2：

// 输入：nums = [0,3,7,2,5,8,4,6,0,1]
// 输出：9
// 示例 3：

// 输入：nums = [1,0,1,2]
// 输出：3


// ⭐ 全流程示意图（最好理解）
// set:
// {1,2,3,4,100,200}


// 遍历每个数：

// 🔍 数字 100：

// 99 不在 set → 是起点

// 往右找 101？不存在
// → 长度 = 1

// 🔍 数字 4：

// 3 在 set → 不是起点
// → 跳过

// 🔍 数字 1：

// 0 不在 set → 是起点

// 往右扩展：

// 1 → 2 → 3 → 4


// 扩展计数：4

// 更新 maxLen = 4

// 🔍 数字 2：

// 因为 1 在 set → 不是起点
// → 跳过

// 🔍 数字 3：

// 2 在 set → 跳过

// 🔍 数字 200：

// 199 不在 set → 是起点

// 201 不存在 → maxLen 还是 4

// 🎯 最终答案：4




var longestConsecutive = function(nums) {
    // 用 Set 去重 & 让查找 O(1)
    const set = new Set(nums);
    let maxLen = 0;

    for (const element of set) {


        if (!set.has(element - 1)) {
            let currentNum = element;
            let currentStreak = 1;
           
            
            while (set.has(currentNum + 1)) {
                currentNum += 1;
                currentStreak += 1
            }
            
            maxLen = Math.max(maxLen, currentStreak);
        }
        
    }

    return maxLen;
};


const long = longestConsecutive([0, 3, 7, 2, 5, 8, 4, 6, 0, 1]);

console.log("long:", long);

// 提示：

// 0 <= nums.length <= 105
// -109 <= nums[i] <= 109
